#include "Header.h"

int main() {
    setlocale(0, "");
    
    //double a, b, x0, y0;

    //std::cout << "¬ведите длину большей полуоси эллипса: ";
    //std::cin >> a;
    //std::cout << "\n¬ведите длину меньшей полуоси эллипса: ";
    //std::cin >> b;
    //std::cout << "\n¬ведите x координату центра эллипса: ";
    //std::cin >> x0;
    //std::cout << "\n¬ведите y координату центра эллипса: ";
    //std::cin >> y0;

    //Point p1, p2, p3, p4;

    //std::cout << "\n¬ведите x координату точки A параллелограмма: ";
    //std::cin >> p1.x;
    //std::cout << "\n¬ведите y координату точки A параллелограмма: ";
    //std::cin >> p1.y;
    //std::cout << "\n¬ведите x координату точки B параллелограмма: ";
    //std::cin >> p2.x;
    //std::cout << "\n¬ведите y координату точки B параллелограмма: ";
    //std::cin >> p2.y;
    //std::cout << "\n¬ведите x координату точки C параллелограмма: ";
    //std::cin >> p3.x;
    //std::cout << "\n¬ведите y координату точки C параллелограмма: ";
    //std::cin >> p3.y;
    //std::cout << "\n¬ведите x координату точки D параллелограмма: ";
    //std::cin >> p4.x;
    //std::cout << "\n¬ведите y координату точки D параллелограмма: ";
    //std::cin >> p4.y;

    double a = 2, b = 3, x0 = 1, y0 = 2;
    Point p1 = { 1,2 }, p2 = { 4,5 }, p3 = { 6,2 }, p4 = { 3,-1 };

    if ((a <= 0) || (b <= 0)) {
        std::cout << "ƒлина полуоси не может принимать значение меньше или равное нулю";
    }
    else if ((checkEquality(p1, p2, p3, p4) == 1) && (checkParallelism(p1, p2, p3, p4) == 1)) {
        firstSide(a, b, x0, y0, p1, p2);
        secondSide(a, b, x0, y0, p2, p3);
        thirdSide(a, b, x0, y0, p3, p4);
        fourthSide(a, b, x0, y0, p1, p4);
    }
    else {
        std::cout << "„етырехугольник не €вл€етс€ параллелограммом";
    }
}